saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_K60_DFP.1.5.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_K60_DFP</name>
  <description>NXP Kinetis K60 Series Device Support and Examples</description>

  <releases>
    <release version="1.5.0" date="2017-02-17">
      Reworked K60_DFP.
      - changed vendor to NXP.
      - updated documentation.
      - Updated boards description.
      Updated device header files: added ARM Clang 6 directives for handling anonymous unions
      Added SVD files from Kinetis SDK for more peripheral visibility
      Added Board description Keil MCBTWRK60, replicated example
    </release>
    <release version="1.4.0" date="2015-06-03">
      Updated MK65F18, MK66F18 device support and documentation.
    </release>
    <release version="1.3.0" date="2015-01-12">
      CMSIS-Core files updated for MK65F18 and MK66F18 device support
    </release>
    <release version="1.2.0" date="2014-09-04">
      CMSIS-Core files updated for MK63F12 and MK64F12 devices
    </release>
    <release version="1.1.0">
      Added FRDM-K64F development board examples
      Added TWR-K64F120M development board examples
    </release>
    <release version="1.0.2">
      Added TWR-K60D100M development boards
    </release>
    <release version="1.0.1">
      New devices: MK63FN1M0xxx12, MK64FN1M0xxx12, MK64FX512xxx12
    </release>
    <release version="1.0.0">
      First Release version of K60 Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>K60</keyword>
  </keywords>

  <devices>
    <family Dfamily="K60 Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1"/>
      <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>

      <description>
The Kinetis K6x MCUs are pin-peripheral and software-compatible with many of the Kinetis K series MCU families, offering IEEE® 1588 Ethernet and full and high-speed USB 2.0 On-The-Go, including options with USB crystal-less functionality.
Devices start from 256 KB of flash in 100 QFP packages extending up to 2 MB flash and 256 KB SRAM in a 256 MAPBGA package. These devices offer various levels of integration, with a rich suite of analog, communication, timing and control peripherals.
Next-generation Kinetis K6x MCUs are further optimized for performance and power consumption and offer more streamlined integration for further BOM cost reductions.
       </description>


      <!-- ******************************  MK60DN512xxx10  ****************************** -->
      <device Dname="MK60DN512xxx10">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device/Include/MK60D10.h" define="MK60DN512xxx10"/>
        <debug svd="SVD/MK60D10.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

        <book name="Documents/K60P144M100SF2V2RM.pdf" title="MK60 100MHz Reference Manual"/>
        <book name="Documents/K60P144M100SF2V2.pdf"   title="MK60 100MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK60DN256xxx10  ****************************** -->
      <device Dname="MK60DN256xxx10">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device/Include/MK60D10.h" define="MK60DN256xxx10"/>
        <debug svd="SVD/MK60D10.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

        <book name="Documents/K60P144M100SF2V2RM.pdf" title="MK60 100MHz Reference Manual"/>
        <book name="Documents/K60P144M100SF2V2.pdf"   title="MK60 100MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK60DX256xxx10  ****************************** -->
      <device Dname="MK60DX256xxx10">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device/Include/MK60D10.h" define="MK60DX256xxx10"/>
        <debug svd="SVD/MK60D10.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
        <memory id="IROM2"                  start="0x10000000" size="0x00040000" startup="0" default="0"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF8000" size="0x00008000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P256.FLM" start="0x00000000" size="0x00040000"             default="1"/>
        <algorithm name="Flash/MK_D256.FLM" start="0x10000000" size="0x00040000"             default="1"/>

        <book name="Documents/K60P144M100SF2V2RM.pdf" title="MK60 100MHz Reference Manual"/>
        <book name="Documents/K60P144M100SF2V2.pdf"   title="MK60 100MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK60FN1M0xxx12  ****************************** -->
      <device Dname="MK60FN1M0xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/MK60F12.h" define="MK60FN1M0xxx12"/>
        <debug svd="SVD/MK60F12.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P1M0.FLM" start="0x00000000" size="0x00100000"             default="1"/>

        <book name="Documents/K60P144M150SF3RM.pdf" title="MK60 120/150MHz Reference Manual"/>
        <book name="Documents/K60P144M120SF3.pdf"   title="MK60 120MHz Data Sheet"/>
      </device>

