saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_K60_DFP.1.5.0.pdsc
      <!-- ******************************  MK60FX512xxx12  ****************************** -->
      <device Dname="MK60FX512xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/MK60F12.h" define="MK60FX512xxx12"/>
        <debug svd="SVD/MK60F12.svd"/>
        <memory id="IROM1"                   start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IROM2"                   start="0x10000000" size="0x00080000" startup="0" default="0"/>
        <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                   start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512X.FLM" start="0x00000000" size="0x00080000"             default="1"/>
        <algorithm name="Flash/MK_D512.FLM"  start="0x10000000" size="0x00080000"             default="1"/>

        <book name="Documents/K60P144M150SF3RM.pdf" title="MK60 120/150MHz Reference Manual"/>
        <book name="Documents/K60P144M120SF3.pdf"   title="MK60 120MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK60FN1M0xxx15  ****************************** -->
      <device Dname="MK60FN1M0xxx15">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="150000000"/>
        <compile header="Device/Include/MK60F15.h" define="MK60FN1M0xxx15"/>
        <debug svd="SVD/MK60F15.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P1M0.FLM" start="0x00000000" size="0x00100000"             default="1"/>

        <book name="Documents/K60P144M150SF3RM.pdf" title="MK60 120/150MHz Reference Manual"/>
        <book name="Documents/K60P144M150SF3.pdf"   title="MK60 150MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK60FX512xxx15  ****************************** -->
      <device Dname="MK60FX512xxx15">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="150000000"/>
        <compile header="Device/Include/MK60F15.h" define="MK60FX512xxx15"/>
        <debug svd="SVD/MK60F15.svd"/>
        <memory id="IROM1"                   start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IROM2"                   start="0x10000000" size="0x00080000" startup="0" default="0"/>
        <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                   start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512X.FLM" start="0x00000000" size="0x00080000"             default="1"/>
        <algorithm name="Flash/MK_D512.FLM"  start="0x10000000" size="0x00080000"             default="1"/>

        <book name="Documents/K60P144M150SF3RM.pdf" title="MK60 120/150MHz Reference Manual"/>
        <book name="Documents/K60P144M150SF3.pdf"   title="MK60 150MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK61FN1M0xxx12  ****************************** -->
      <device Dname="MK61FN1M0xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/MK61F12.h" define="MK61FN1M0xxx12"/>
        <debug svd="SVD/MK61F12.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P1M0.FLM" start="0x00000000" size="0x00100000"             default="1"/>

        <book name="Documents/K61P256M150SF3RM.pdf" title="MK61 120/150 MHz Reference Manual"/>
        <book name="Documents/K61P256M120SF3.pdf"   title="MK61 120MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK61FX512xxx12  ****************************** -->
      <device Dname="MK61FX512xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/MK61F12.h" define="MK61FX512xxx12"/>
        <debug svd="SVD/MK61F12.svd"/>
        <memory id="IROM1"                   start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IROM2"                   start="0x10000000" size="0x00080000" startup="0" default="0"/>
        <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                   start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512X.FLM" start="0x00000000" size="0x00080000"             default="1"/>
        <algorithm name="Flash/MK_D512.FLM"  start="0x10000000" size="0x00080000"             default="1"/>

        <book name="Documents/K61P256M150SF3RM.pdf" title="MK61 120/150MHz Reference Manual"/>
        <book name="Documents/K61P256M120SF3.pdf"   title="MK61 120MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK61FN1M0xxx15  ****************************** -->
      <device Dname="MK61FN1M0xxx15">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="150000000"/>
        <compile header="Device/Include/MK61F15.h" define="MK61FN1M0xxx15"/>
        <debug svd="SVD/MK61F15.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P1M0.FLM" start="0x00000000" size="0x00100000"             default="1"/>

        <book name="Documents/K61P256M150SF3RM.pdf" title="MK61 120/150 MHz Reference Manual"/>
        <book name="Documents/K61P256M150SF3.pdf"   title="MK61 150MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK61FX512xxx15  ****************************** -->
      <device Dname="MK61FX512xxx15">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="150000000"/>
        <compile header="Device/Include/MK61F15.h" define="MK61FX512xxx15"/>
        <debug svd="SVD/MK61F15.svd"/>
        <memory id="IROM1"                   start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IROM2"                   start="0x10000000" size="0x00080000" startup="0" default="0"/>
        <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
        <memory id="IRAM2"                   start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512X.FLM" start="0x00000000" size="0x00080000"             default="1"/>
        <algorithm name="Flash/MK_D512.FLM"  start="0x10000000" size="0x00080000"             default="1"/>

        <book name="Documents/K61P256M150SF3RM.pdf" title="MK61 120/150 MHz Reference Manual"/>
        <book name="Documents/K61P256M150SF3.pdf"   title="MK61 150MHz Data Sheet"/>
      </device>

