saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_K60_DFP.1.5.0.pdsc
      <!-- ******************************  MK63FN1M0xxx12  ****************************** -->
      <device Dname="MK63FN1M0xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/MK63F12.h" define="MK63FN1M0xxx12"/>
        <debug svd="SVD/MK63F12.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00030000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P1M0.FLM" start="0x00000000" size="0x00100000"             default="1"/>

        <book name="Documents/K63P144M120SF5RM.pdf" title="MK63 120MHz Reference Manual"/>
        <book name="Documents/K63P144M120SF5.pdf"   title="MK63 120MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK64FN1M0xxx12  ****************************** -->
      <device Dname="MK64FN1M0xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/MK64F12.h" define="MK64FN1M0xxx12"/>
        <debug svd="SVD/MK64F12.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00030000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P1M0.FLM" start="0x00000000" size="0x00100000"             default="1"/>

        <book name="Documents/K64P144M120SF5RM.pdf" title="MK64 120MHz Reference Manual"/>
        <book name="Documents/K64P144M120SF5.pdf"   title="MK64 120MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK64FX512xxx12  ****************************** -->
      <device Dname="MK64FX512xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/MK64F12.h" define="MK64FX512xxx12"/>
        <debug svd="SVD/MK64F12.svd"/>
        <memory id="IROM1"                            start="0x00000000" size="0x00080000" startup="1" default="1"/>
        <memory id="IROM2"                            start="0x10000000" size="0x00020000" startup="0" default="0"/>
        <memory id="IRAM1"                            start="0x20000000" size="0x00020000" init   ="0" default="1"/>
        <memory id="IRAM2"                            start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P512X.FLM"          start="0x00000000" size="0x00080000"             default="1"/>
        <algorithm name="Flash/MKD128_4KB_SECTOR.FLM" start="0x10000000" size="0x00020000"             default="1"/>

        <book name="Documents/K64P144M120SF5RM.pdf" title="MK64 120MHz Reference Manual"/>
        <book name="Documents/K64P144M120SF5.pdf"   title="MK64 120MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK65FN2M0xxx18  ****************************** -->
      <device Dname="MK65FN2M0xxx18">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="180000000"/>
        <compile header="Device/Include/MK65F18.h" define="MK65FN2M0xxx18"/>
        <debug svd="SVD/MK65F18.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00200000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00030000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P2M0.FLM" start="0x00000000" size="0x00200000"             default="1"/>

        <book name="Documents/K65P169M180SF5RMV2.pdf" title="MK65 180MHz Reference Manual"/>
        <book name="Documents/K65P169M180SF5V2.pdf"   title="MK65 180MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK65FX1M0xxx18  ****************************** -->
      <device Dname="MK65FX1M0xxx18">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="180000000"/>
        <compile header="Device/Include/MK65F18.h" define="MK65FX1M0xxx18"/>
        <debug svd="SVD/MK65F18.svd"/>
        <memory id="IROM1"                            start="0x00000000" size="0x00100000" startup="1" default="1"/>
        <memory id="IROM2"                            start="0x10000000" size="0x00040000" startup="0" default="0"/>
        <memory id="IRAM1"                            start="0x20000000" size="0x00030000" init   ="0" default="1"/>
        <memory id="IRAM2"                            start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P1M0.FLM"           start="0x00000000" size="0x00100000"             default="1"/>
        <algorithm name="Flash/MKD256_4KB_SECTOR.FLM" start="0x10000000" size="0x00040000"             default="1"/>

        <book name="Documents/K65P169M180SF5RMV2.pdf" title="MK65 180MHz Reference Manual"/>
        <book name="Documents/K65P169M180SF5V2.pdf"   title="MK65 180MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK66FN2M0xxx18  ****************************** -->
      <device Dname="MK66FN2M0xxx18">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="180000000"/>
        <compile header="Device/Include/MK66F18.h" define="MK66FN2M0xxx18"/>
        <debug svd="SVD/MK66F18.svd"/>
        <memory id="IROM1"                  start="0x00000000" size="0x00200000" startup="1" default="1"/>
        <memory id="IRAM1"                  start="0x20000000" size="0x00030000" init   ="0" default="1"/>
        <memory id="IRAM2"                  start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P2M0.FLM" start="0x00000000" size="0x00200000"             default="1"/>

