saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_K60_DFP.1.5.0.pdsc
        <book name="Documents/K66P144M180SF5RMV2.pdf" title="MK66 180MHz Reference Manual"/>
        <book name="Documents/K66P144M180SF5V2.pdf"   title="MK66 180MHz Data Sheet"/>
      </device>

      <!-- ******************************  MK66FX1M0xxx18  ****************************** -->
      <device Dname="MK66FX1M0xxx18">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="180000000"/>
        <compile header="Device/Include/MK66F18.h" define="MK66FX1M0xxx18"/>
        <debug svd="SVD/MK66F18.svd"/>
        <memory id="IROM1"                            start="0x00000000" size="0x00100000" startup="1" default="1"/>
        <memory id="IROM2"                            start="0x10000000" size="0x00040000" startup="0" default="0"/>
        <memory id="IRAM1"                            start="0x20000000" size="0x00030000" init   ="0" default="1"/>
        <memory id="IRAM2"                            start="0x1FFF0000" size="0x00010000" init   ="0" default="0"/>
        <algorithm name="Flash/MK_P1M0.FLM"           start="0x00000000" size="0x00100000"             default="1"/>
        <algorithm name="Flash/MKD256_4KB_SECTOR.FLM" start="0x10000000" size="0x00040000"             default="1"/>

        <book name="Documents/K66P144M180SF5RMV2.pdf" title="MK66 180MHz Reference Manual"/>
        <book name="Documents/K66P144M180SF5V2.pdf"   title="MK66 180MHz Data Sheet"/>
      </device>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="MK60D10 CMSIS">
      <description>NXP Kinetis K60D 100MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK60DN512xxx10"/>
      <accept  Dname="MK60DN256xxx10"/>
      <accept  Dname="MK60DX256xxx10"/>
      </condition>
    <condition id="MK60F12 CMSIS">
      <description>NXP Kinetis K60F 120MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK60FN1M0xxx12"/>
      <accept  Dname="MK60FX512xxx12"/>
    </condition>
    <condition id="MK61F12 CMSIS">
      <description>NXP Kinetis K61F 120MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK61FN1M0xxx12"/>
      <accept  Dname="MK61FX512xxx12"/>
    </condition>
    <condition id="MK60F15 CMSIS">
      <description>NXP Kinetis K60F 150MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK60FN1M0xxx15"/>
      <accept  Dname="MK60FX512xxx15"/>
    </condition>
    <condition id="MK61F15 CMSIS">
      <description>NXP Kinetis K61F 150MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK61FN1M0xxx15"/>
      <accept  Dname="MK61FX512xxx15"/>
    </condition>
    <condition id="MK63F12 CMSIS">
      <description>NXP Kinetis K63F 120MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK63FN1M0xxx12"/>
    </condition>
    <condition id="MK64F12 CMSIS">
      <description>NXP Kinetis K64F 120MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK64FN1M0xxx12"/>
      <accept  Dname="MK64FX512xxx12"/>
    </condition>
    <condition id="MK65F18 CMSIS">
      <description>NXP Kinetis K65F 180MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK65FN2M0xxx18"/>
      <accept  Dname="MK65FX1M0xxx18"/>
    </condition>
    <condition id="MK66F18 CMSIS">
      <description>NXP Kinetis K66F 180MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="MK66FN2M0xxx18"/>
      <accept  Dname="MK66FX1M0xxx18"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup MK60D10 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK60D10 CMSIS">
      <description>System Startup for NXP MK60D10 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK60D10.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK60D10.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MK60F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK60F12 CMSIS">
      <description>System Startup for NXP MK60F12 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK60F12.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK60F12.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MK61F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK61F12 CMSIS">
      <description>System Startup for NXP MK61F12 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK61F12.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK61F12.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MK60F15 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK60F15 CMSIS">
      <description>System Startup for NXP MK60F15 Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MK60F15.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MK60F15.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
